import 'package:flutter/material.dart';

class BookThree extends StatefulWidget {
  const BookThree({Key? key}) : super(key: key);

  @override
  _BookThreeState createState() => _BookThreeState();
}

class _BookThreeState extends State<BookThree> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: Text('ปฐมกาล'),),
      body: const Card(
        child: Expanded(
          child: SizedBox(
            
            child: Center(
              child: Text(
                  'กลางวัน กลางคืน\nคุณชอบอะไรมากกว่ากันหรือ?\nคุณชอบกลางวัน เพราะแสงสว่างทำให้คุณรู้สึกสดชื่น\nอากาศยามเช้ามีที่มีหมอกลง เสียงนกร้องทัก\nการได้พบเจอผู้คนมากมายและการได้อยู่กับ “เขา”\n\nเราชอบกลางคืน เพราะมันเป็นความรู้สึกโล่งใจ\nเป็นเวลาที่ได้อยู่กับตัวเอง นั่งฟังเพลงในเพลย์ลิสต์ที่ชอบ\nได้ดูหนังเรื่องโปรด และได้นั่งมองดวงดาวเพื่อ\n“คิดถึงคุณ”\n\n\n\nฤดูกาลที่คุณโปรดมากที่สุด คืออันไหนกัน?\nคุณชอบฤดูร้อน เพราะ มันทำให้ต้นไม้ที่คุณปลูกเติบโต\nเป็นช่วงซัมเมอร์ที่คุณจะได้หยุดพักหรือ\nเริ่มท่องเที่ยวไปในสถานที่ที่ต้องการ ทำให้ได้สนุกกับ "เขา"ได้อย่างเต็มที่\n\nเราชอบฤดูหนาว เพราะ มันเป็นช่วงเวลาที่พระอาทิตย์\nจะขึ้นช้าและตกเร็วกว่าปกติ เป็นอากาศที่ร่างกาย\nจะได้รับลมหนาวได้ใส่เสื้อ ห่มผ้าตัวหนาให้อบอุ่น\nและได้นอนกอดกับ คุณ\n\n\nคุณคิดว่าสิ่งที่โปรดที่สุดของคุณคืออะไร\nสำหรับคุณ คงอาจจะเป็นฤดูกาลที่เปลี่ยนไปตลอดปี\nหรือ ช่วงเวลาที่เปลี่ยนไปตามวัน\nส่วนเราชอบทุกช่วงเวลาที่มีคุณเลยนะ\n"คุณของเรา”'),
            ),
          ),
        ),
      ),
    );
  }
}
